Repository: Apsoni101/qr_scanner_google_sheets
Catalog: lib/core/localisation/intl_*.arb
Languages: hi

source: Scan, Extract, Save
hi: स्कैन करें, निकालें, सहेजें

source: Home
hi: होम

source: History
hi: इतिहास

source: Scan QR Code
hi: QR कोड स्कैन करें

# pointCameraAtQrCodeToScanInstantly
source: Point camera at a QR code to scan instantly
hi: तुरंत स्कैन करने के लिए कैमरा को QR कोड पर रखें

source: Point your camera at a QR code
hi: अपने कैमरे को QR कोड पर रखें

source: Extract Text (OCR)
hi: टेक्स्ट निकालें (OCR)

source: Extract text from images or camera
hi: छवियों या कैमरे से टेक्स्ट निकालें

source: Welcome
hi: स्वागत है

source: Create
hi: बनाएं

source: Review Before Saving
hi: सहेजने से पहले समीक्षा करें

source: Settings
hi: सेटिंग्स

source: No scan history yet
hi: अभी तक कोई स्कैन इतिहास नहीं है

source: Your saved scans will appear here
hi: आपके सहेजे गए स्कैन यहां दिखाई देंगे

# version1
source: Version 1.0.0
hi: संस्करण 1.0.0

source: Sign in to sync your scans across devices
hi: अपने उपकरणों में स्कैन सिंक करने के लिए साइन इन करें

source: Signing in...
hi: साइन इन हो रहा है...

source: Continue with Google
hi: Google के साथ जारी रखें

# newUserSameButtonCreatesYourAccountAutomatically
source: New user? The same button creates your account automatically
hi: नए उपयोगकर्ता? यही बटन स्वचालित रूप से आपका खाता बना देता है

source: Failed to sign in. Please try again.
hi: साइन इन करने में विफल। कृपया पुनः प्रयास करें।

source: By continuing, you agree to our Terms of Service and Privacy Policy
hi: जारी रखकर, आप हमारी सेवा की शर्तों और गोपनीयता नीति से सहमत हैं

source: APPEARANCE
hi: प्रदर्शन

source: Theme
hi: थीम

source: Dark
hi: डार्क

source: Light
hi: लाइट

source: Capture image
hi: छवि कैप्चर करें

source: Upload Image
hi: छवि अपलोड करें

source: Language
hi: भाषा

source: Saved to :
hi: यहां सहेजा गया:

source: English
hi: अंग्रेज़ी

source: ACCOUNT
hi: खाता

source: Error loading user
hi: उपयोगकर्ता लोड करने में त्रुटि

source: User
hi: उपयोगकर्ता

source: No email
hi: कोई ईमेल नहीं

source: Signed Out
hi: साइन आउट हो गया

source: You have been signed out
hi: आप साइन आउट हो गए हैं

source: ABOUT
hi: के बारे में

source: Log out
hi: लॉग आउट

source: Privacy Policy
hi: गोपनीयता नीति

source: Terms of Service
hi: सेवा की शर्तें

# helpAndSupport
source: Help & Support
hi: मदद और सहायता

source: Extract from Camera
hi: कैमरे से निकालें

# capturePhotoAndExtractTextInstantly
source: Capture a photo and extract text instantly
hi: फोटो कैप्चर करें और तुरंत टेक्स्ट निकालें

source: Extract from Image
hi: छवि से निकालें

# uploadExistingImageToExtractText
source: Upload an existing image to extract text
hi: टेक्स्ट निकालने के लिए मौजूदा छवि अपलोड करें

source: Extract Text
hi: टेक्स्ट निकालें

source: Welcome Back
hi: वापसी पर स्वागत है

# loginSuccess
source: Login successful!
hi: लॉगिन सफल!

# qrScanError
source: Something went wrong while scanning the QR code
hi: QR कोड स्कैन करते समय कुछ गलत हो गया

# noQrCodeFound
source: No QR code found in image
hi: छवि में कोई QR कोड नहीं मिला

source: Upload from Gallery
hi: गैलरी से अपलोड करें

source: View History
hi: इतिहास देखें

source: Scanned Content
hi: स्कैन की गई सामग्री

# addCommentTitle
source: Add Comment (Optional)
hi: टिप्पणी जोड़ें (वैकल्पिक)

source: Add a note or description...
hi: एक नोट या विवरण जोड़ें...

source: Select Google Sheet
hi: Google Sheet चुनें

source: Save to Sheet
hi: Sheet में सहेजें

# selectImagePrompt
source: Select an image to extract text
hi: टेक्स्ट निकालने के लिए एक छवि चुनें

source: Extracted Text
hi: निकाला गया टेक्स्ट

source: Text copied to clipboard
hi: टेक्स्ट क्लिपबोर्ड पर कॉपी किया गया

source: Select Sheet
hi: Sheet चुनें

# cameraButtonLabel
source: Camera
hi: कैमरा

# galleryButtonLabel
source: Gallery
hi: गैलरी

source: Live Text Recognition
hi: लाइव टेक्स्ट पहचान

# cancelButton
source: Cancel
hi: रद्द करें

source: Confirm Save
hi: सहेजने की पुष्टि करें

# data
source: QR Data:
hi: QR डेटा:

source: QR Result
hi: QR परिणाम

source: Comment:
hi: टिप्पणी:

source: (No comment added)
hi: (कोई टिप्पणी नहीं जोड़ी गई)

source: Confirm
hi: पुष्टि करें

source: Gallery
hi: गैलरी

source: Camera
hi: कैमरा

source: Cancel
hi: रद्द करें

# saveButton
source: Save
hi: सहेजें

# allScansSuccessfullyMessage
source: All scans synced successfully!
hi: सभी स्कैन सफलतापूर्वक सिंक हो गए!

# syncingMessage
source: Syncing {count} scan
hi: {count} स्कैन सिंक हो रहा है

# syncingMessagePlural
source: Syncing {count} scans
hi: {count} स्कैन सिंक हो रहे हैं

# confirmAndSaveTitle
source: Confirm & Save
hi: पुष्टि करें और सहेजें

# scanDetailsTitle
source: Scan Details
hi: स्कैन विवरण

# selectSheetTitle
source: Select Sheet
hi: Sheet चुनें

# newSheetNameTitle
source: New Sheet Name
hi: नई Sheet का नाम

source: Enter sheet name...
hi: Sheet का नाम दर्ज करें...

# createSheetButton
source: Create Sheet
hi: Sheet बनाएं

source: Switch to Select Sheet
hi: Sheet चुनें पर जाएं

source: Create New Sheet
hi: नई Sheet बनाएं

# noSheetsAvailable
source: No sheets available. Create a new one!
hi: कोई Sheet उपलब्ध नहीं है। एक नई बनाएं!

source: Scan saved successfully!
hi: स्कैन सफलतापूर्वक सहेजा गया!

# modified
source: Modified: {date}
hi: संशोधित: {date}

source: Scan History
hi: स्कैन इतिहास

source: Search scans...
hi: स्कैन खोजें...

source: No scans yet
hi: अभी तक कोई स्कैन नहीं

source: No results found
hi: कोई परिणाम नहीं मिला

# commentLabel
source: Comment
hi: टिप्पणी

source: Copied to clipboard
hi: क्लिपबोर्ड पर कॉपी किया गया

source: just now
hi: अभी

# minutesAgo
source: {minutes}m ago
hi: {minutes} मिनट पहले

# hoursAgo
source: {hours}h ago
hi: {hours} घंटे पहले

# daysAgo
source: {days}d ago
hi: {days} दिन पहले

source: Failed to fetch history
hi: इतिहास लाने में विफल

source: Refreshing...
hi: रीफ्रेश हो रहा है...

source: Camera permission denied
hi: कैमरा अनुमति अस्वीकृत

# scanningNotSupported
source: QR scanning is not supported on this device
hi: इस डिवाइस पर QR स्कैनिंग समर्थित नहीं है

# scannerControllerDisposed
source: Scanner error: Controller disposed
hi: स्कैनर त्रुटि: कंट्रोलर डिस्पोज़ हो गया

# scannerError
source: Error: {errorCode}
hi: त्रुटि: {errorCode}

# qrCodeDetailsTitle
source: QR Code Details
hi: QR कोड विवरण

source: Offline Mode
hi: ऑफलाइन मोड

# waitingToSyncMessage
source: {count} scan waiting to sync
hi: {count} स्कैन सिंक होने की प्रतीक्षा में

# noQrFound
source: No QR code found in image
hi: छवि में कोई QR कोड नहीं मिला

source: Error processing image
hi: छवि प्रोसेस करने में त्रुटि

# waitingToSyncMessagePlural
source: {count} scans waiting to sync
hi: {count} स्कैन सिंक होने की प्रतीक्षा में

# scanToSyncMessage
source: {count} Scan to Sync
hi: {count} स्कैन सिंक करने के लिए

# scanToSyncMessagePlural
source: {count} Scans to Sync
hi: {count} स्कैन सिंक करने के लिए

# connectionAvailableSync
source: Connection available - click to sync
hi: कनेक्शन उपलब्ध है - सिंक करने के लिए क्लिक करें

# syncButtonLabel
source: Sync
hi: सिंक करें

# noInternetConnection
source: No internet connection. Scans will sync when online.
hi: कोई इंटरनेट कनेक्शन नहीं है। ऑनलाइन होने पर स्कैन सिंक हो जाएंगे।

# cannotRefreshSheets
source: No internet connection. Cannot refresh sheets.
hi: कोई इंटरनेट कनेक्शन नहीं है। Sheet रीफ्रेश नहीं की जा सकती।

# cameraPermissionTitle
source: Camera Permission Required
hi: कैमरा अनुमति आवश्यक है

# galleryPermissionTitle
source: Gallery Permission Required
hi: गैलरी अनुमति आवश्यक है

# permissionRequiredMessage
source: This app needs permission to access your device. Please grant permission to continue.
hi: इस ऐप को आपके डिवाइस तक पहुंचने के लिए अनुमति की आवश्यकता है। कृपया जारी रखने के लिए अनुमति दें।

# permissionPermanentlyDeniedMessage
source: Permission is permanently denied. Please enable it in app settings.
hi: अनुमति स्थायी रूप से अस्वीकृत है। कृपया इसे ऐप सेटिंग्स में सक्षम करें।

source: Open Settings
hi: सेटिंग्स खोलें

source: Retry
hi: पुनः प्रयास करें

# cancelButtonLabel
source: Cancel
hi: रद्द करें
